; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 719747 1 2 2 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star2 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star10)
   goals met: 0 of 5
5. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 1 of 5
6. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 5
8. (take_image satellite0 phenomenon9 instrument0 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 2 of 5
9. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 5
11. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 3 of 5
12. (turn_to satellite0 star1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star1)
   goals met: 4 of 5
13. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 3 of 5
14. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 4 of 5
15. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   goals met: 5 of 5
